NTR/database/case_templates/openfoam_channel_les/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This application/dictionary controls:
// - optional: create new patches from boundary faces (either given as
//   a set of patches or as a faceSet)
// - always: order faces on coupled patches such that they are opposite. This
//   is done for all coupled faces, not just for any patches created.
// - optional: synchronise points on coupled patches.
// - always: remove zero-sized (non-coupled) patches (that were not added)

// 1. Create cyclic:
// - specify where the faces should come from
// - specify the type of cyclic. If a rotational specify the rotationAxis
//   and centre to make matching easier
// - always create both halves in one invocation with correct 'neighbourPatch'
//   setting.
// - optionally pointSync true to guarantee points to line up.

// 2. Correct incorrect cyclic:
// This will usually fail upon loading:
//  "face 0 area does not match neighbour 2 by 0.0100005%"
//  " -- possible face ordering problem."
// - in polyMesh/boundary file:
//      - loosen matchTolerance of all cyclics to get case to load
//      - or change patch type from 'cyclic' to 'patch'
//        and regenerate cyclic as above

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

L   #calc "8*constant::mathematical::pi"; // Lx --> Streamwise domain size in UTexas
Lneg   #calc "-8*constant::mathematical::pi";

// Patches to create.
patches
(

	///TRANSLATIONAL CYCLICS

    {
        // Name of new patch
        name INLET;

        // Dictionary to construct new patch from
        patchInfo
        {
            type cyclic;
            neighbourPatch OUTLET;

            transform translational;
            separationVector ($L 0 0); //8pi --> for of8 type hier Lneg instead of L
            matchTolerance 0.02;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (INLETper);

    }
    {
        // Name of new patch
        name OUTLET;

        // Dictionary to construct new patch from
        patchInfo
        {
            type cyclic;
            neighbourPatch INLET;

            transform translational;
            separationVector ($Lneg 0 0); //-8pi --> for of8 type hier L instead of Lneg
            matchTolerance 0.02;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (OUTLETper);
    }




);

// ************************************************************************* //
