NTR/database/case_templates/openfoam_channel_les/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type probes;

// Fields to be probed. runTime modifiable!
fields
(
    p
    U
    Umean
);

// Locations to be probed. runTime modifiable!
probeLocations
(
    (12 0 4.7)
    (12 0.1 4.7)
    (12 0.2 4.7)
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
